       IDENTIFICATION DIVISION.
       PROGRAM-ID. BATCHRPT.
      ****************************************************************
      * This program processes files:                                *
      *      Input Files  = Employee Extract File (Sequential)       *
      *                     Selection Control Card                   *
      *      Output File  = Employee Yrs Employed Report             *
      ****************************************************************

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      * INPUT FILE: EMPLOYEE RECORDS
           SELECT EMP-SEQ-FILE       ASSIGN TO UT-S-EMPSEQ.

      * INPUT FILE: DATE SELECTION CRITERIA
           SELECT IN-CNTL-CARD       ASSIGN TO UT-S-CNTLCARD.

      * OUTPUT REPORT FILE
           SELECT EMP-HIRE-RPT       ASSIGN TO UT-S-HIRERPT.

       DATA DIVISION.
       FILE SECTION.

       FD  EMP-SEQ-FILE
           LABEL RECORDS ARE STANDARD.
       01 EMPLOYEE-RECORD PIC X(60).

       FD  IN-CNTL-CARD
           LABEL RECORDS ARE STANDARD.
       01 CONTROL-RECORD PIC X(8).

       FD  EMP-HIRE-RPT
           LABEL RECORDS ARE STANDARD.
       01 RPT-RECORD PIC X(80).
       WORKING-STORAGE SECTION.
       01 PROGRAM-FIELDS.
         05 EOF-FLAG PIC X(01) VALUE 'N'.
           88 AT-EOF VALUE 'Y'.
           88 NOT-AT-EOF VALUE 'N'.
         05 COUNTERS.
           10 EMP-REC-CNTR PIC 9(05) VALUE 0.
           10 LINE-CTR PIC 9(03) VALUE 0.
           10 LINE-MAX PIC 9(03) VALUE 60.
         05 CURR-DATE.
           10 CURR-YYYY PIC 9(4).
           10 CURR-MM PIC 9(2).
           10 CURR-DD PIC 9(2).
         05 CURR-TIME.
           10 CURR-HR PIC 9(2).
           10 CURR-MIN PIC 9(2).
           10 CURR-SEC PIC 9(2).
         05 YRS-EMPLOYED PIC 9(03) COMP-3 VALUE 0.
       01 CONTROL-REC.
         05 CNTL-DATE.
           10 CNTL-YR PIC X(4) VALUE SPACE.
           10 CNTL-MON PIC X(2) VALUE SPACE.
           10 CNTL-DAY PIC X(2) VALUE SPACE.
      **  Employee Record Layout
       01 EMP-RECORD-IO-AREA.
           COPY EMPSEQ.
      **  Report Lines
       01 RPT-TITLE-1.
         05 FILLER PIC X(20) VALUE ' Program: BATCHRPT'.
         05 FILLER PIC X(10) VALUE SPACES.
         05 FILLER PIC X(25) VALUE 'Years Employed Report'.
         05 FILLER PIC X(10) VALUE SPACES.
         05 RPT-CURR-MM PIC X(2).
         05 FILLER PIC X VALUE '/'.
         05 RPT-CURR-DD PIC X(2).
         05 FILLER PIC X VALUE '/'.
         05 RPT-CURR-YYYY PIC X(4).
         05 FILLER PIC X(5) VALUE SPACE.
       01 RPT-TITLE-2.
         05 FILLER PIC X(67) VALUE SPACES.
         05 RPT-CURR-HR PIC X(2).
         05 FILLER PIC X VALUE ':'.
         05 RPT-CURR-MIN PIC X(2).
         05 FILLER PIC X VALUE ':'.
         05 RPT-CURR-SEC PIC X(2).
         05 FILLER PIC X(5) VALUE SPACE.
       01 RPT-TITLE-3.
         05 FILLER PIC X(5) VALUE SPACE.
         05 FILLER PIC X(7) VALUE '***** '.
         05 RPT-SELECTION-YYYY PIC 9(4).
         05 FILLER PIC X(2) VALUE '年'.
         05 RPT-SELECTION-MM PIC Z9.
         05 FILLER PIC X(2) VALUE '月'.
         05 RPT-SELECTION-DD PIC Z9.
         05 FILLER PIC X(24) VALUE '日以前に入社した社員一覧'.
         05 FILLER PIC X(12) VALUE SPACE.

       01 RPT-COLUMNS.
         05 FILLER PIC X(5) VALUE SPACES.
         05 FILLER PIC X(11) VALUE '部署名'.
         05 FILLER PIC X(21) VALUE '社員名'.
         05 FILLER PIC X(14) VALUE '社員番号'.
         05 FILLER PIC X(15) VALUE '入社日'.
         05 FILLER PIC X(14) VALUE '雇用年数'.
       01 RPT-DETAIL-LINE.
         05 FILLER PIC X(5) VALUE SPACES.
         05 RPT-EMP-DIV PIC N(5) VALUE SPACES.
         05 FILLER PIC X VALUE SPACES.
         05 RPT-EMP-NAME PIC N(10) VALUE SPACES.
         05 FILLER PIC X VALUE SPACES.
         05 RPT-EMP-SSN PIC X(9) VALUE SPACES.
         05 FILLER PIC X(5) VALUE SPACES.
         05 RPT-EMP-HIRE-MM PIC X(2) VALUE SPACES.
         05 FILLER PIC X VALUE '/'.
         05 RPT-EMP-HIRE-DD PIC X(2) VALUE SPACES.
         05 FILLER PIC X VALUE '/'.
         05 RPT-EMP-HIRE-YYYY PIC X(4) VALUE SPACES.
         05 FILLER PIC X(5) VALUE SPACES.
         05 RPT-EMP-YRS-EMPL PIC Z9 VALUE ZEROES.
         05 FILLER PIC X(12) VALUE SPACE.

       01 RPT-TOTAL-LINE.
         05 FILLER PIC X(5) VALUE SPACE.
         05 FILLER PIC X(7) VALUE '***** '.
         05 RPT-MSG PIC X(30) VALUE SPACE.
         05 FILLER PIC X(2) VALUE SPACE.
         05 RPT-TOT-RECS PIC ZZZ.
         05 FILLER PIC X(33) VALUE SPACE.

       01 BLANK-LINE PIC X(80) VALUE SPACE.
       PROCEDURE DIVISION.
           PERFORM 1000-START THRU 1000-EXIT.
           PERFORM 2000-MAIN-PROCESSING THRU 2000-EXIT UNTIL AT-EOF.
           PERFORM 9000-CLOSE-AND-CLEANUP THRU 9000-EXIT.
           STOP RUN.

       1000-START SECTION.
           OPEN INPUT EMP-SEQ-FILE
             IN-CNTL-CARD.
           OPEN OUTPUT EMP-HIRE-RPT.

      ***
      *  SET UP AND WRITE REPORT TITLE AND COLUMN HEADINGS
      ***
           ACCEPT CURR-DATE FROM DATE YYYYMMDD.
           MOVE CURR-MM TO RPT-CURR-MM.
           MOVE CURR-DD TO RPT-CURR-DD.
           MOVE CURR-YYYY TO RPT-CURR-YYYY.

           ACCEPT CURR-TIME FROM TIME.
           MOVE CURR-HR TO RPT-CURR-HR.
           MOVE CURR-MIN TO RPT-CURR-MIN.
           MOVE CURR-SEC TO RPT-CURR-SEC.

           WRITE RPT-RECORD FROM RPT-TITLE-1 BEFORE ADVANCING 1 LINE.
           WRITE RPT-RECORD FROM RPT-TITLE-2 BEFORE ADVANCING 1 LINE.
      ***
      *  READ CONTROL CARD FILE TO GET DATE FOR SELECTION CRITERIA.
      *  IF FILE IS EMPTY, DEFAULT CNTL-DATE TO CURRENT DATE.
      ***
           READ IN-CNTL-CARD INTO CONTROL-REC.

           IF CNTL-DATE = SPACES
               MOVE CURR-DATE TO CNTL-DATE
           END-IF.

      *    ACCEPT CNTL-DATE FROM SYSIN.

           MOVE CNTL-MON TO RPT-SELECTION-MM.
           MOVE CNTL-DAY TO RPT-SELECTION-DD.
           MOVE CNTL-YR TO RPT-SELECTION-YYYY.

           WRITE RPT-RECORD FROM RPT-TITLE-3 BEFORE ADVANCING 1 LINE.
           WRITE RPT-RECORD FROM BLANK-LINE BEFORE ADVANCING 1 LINE.

           WRITE RPT-RECORD FROM RPT-COLUMNS BEFORE ADVANCING 1 LINE.
           WRITE RPT-RECORD FROM BLANK-LINE BEFORE ADVANCING 1 LINE.

       1000-EXIT.
           EXIT.
       2000-MAIN-PROCESSING.
           READ EMP-SEQ-FILE INTO EMP-RECORD-IO-AREA
               AT END
                   MOVE 'Y' TO EOF-FLAG.

           IF NOT-AT-EOF
               PERFORM 3000-PROCESS-RECORD THRU 3000-EXIT
           END-IF.

       2000-EXIT.
           EXIT.

       3000-PROCESS-RECORD.
      ***
      *   FIRST, VERIFY EMPLOYEE'S HIRE DATE IS ON OR BEFORE DATE
      *   PASSED IN CONTROL CARD.
      ***
           IF EMPREC-DATE-OF-HIRE <= CNTL-DATE
               CONTINUE
           ELSE
               GO TO 3000-EXIT
           END-IF.
      ***
      *   FORMAT REPORT DETAIL LINES FROM EMPLOYEE RECORD.
      ***
           MOVE EMPREC-DIV TO RPT-EMP-DIV.

           MOVE SPACE TO RPT-EMP-NAME.
           STRING EMPREC-JNAME1 DELIMITED BY SPACE
             SPACE DELIMITED BY SIZE
             EMPREC-JNAME2 DELIMITED BY SPACE
             INTO RPT-EMP-NAME.

           STRING EMPREC-SSN(1:7) DELIMITED BY SIZE
             '-' DELIMITED BY SIZE
             EMPREC-SSN(8:1) DELIMITED BY SIZE
             INTO RPT-EMP-SSN.

           MOVE EMPREC-DOH-MM TO RPT-EMP-HIRE-MM.
           MOVE EMPREC-DOH-DD TO RPT-EMP-HIRE-DD.
           MOVE EMPREC-DOH-YYYY TO RPT-EMP-HIRE-YYYY.

           PERFORM 4000-COMPUTE-YEARS-EMPLOYED THRU 4000-EXIT.
           MOVE YRS-EMPLOYED TO RPT-EMP-YRS-EMPL.

           WRITE RPT-RECORD FROM RPT-DETAIL-LINE
             BEFORE ADVANCING 1 LINE.
           ADD 1 TO EMP-REC-CNTR.

       3000-EXIT.
           EXIT.
       4000-COMPUTE-YEARS-EMPLOYED.
      ****
      *   DETERMINE YEARS OF EMPLOYMENT BY SUBTRACTING HIRE YEAR
      *   FROM CURRENT YEAR.
      ****

           COMPUTE YRS-EMPLOYED = CURR-YYYY - EMPREC-DOH-YYYY.

       4000-EXIT.
           EXIT.
       9000-CLOSE-AND-CLEANUP.

           IF EMP-REC-CNTR > 0
               MOVE '処理レコード件数:' TO RPT-MSG
               MOVE EMP-REC-CNTR TO RPT-TOT-RECS
           ELSE
               MOVE '処理レコードなし' TO RPT-MSG
           END-IF.

           DISPLAY '***  REPORT CREATED SUCCESSFULLY  ***'.
           DISPLAY '***       VIEW:  HIRERPT.DAT      ***'.

           WRITE RPT-RECORD FROM BLANK-LINE BEFORE ADVANCING 1 LINE.
           WRITE RPT-RECORD FROM RPT-TOTAL-LINE BEFORE ADVANCING 1 LINE.

           CLOSE EMP-SEQ-FILE
             IN-CNTL-CARD
             EMP-HIRE-RPT.

       9000-EXIT.
           EXIT.

       end program BATCHRPT.